programming/java/code/think-java/think-java.org
#+title: Think Java
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

# book: Java SE Development Kit 8

* 01 The way of the program

** =Hello.java=

#+BEGIN_SRC java -n :bangle Hello.java :padline no
  public class Hello {

    public static void main(String[] args) {
      // generate some simple output
      System.out.println("Hello, World!");
    }
  }
#+END_SRC

** =Goodbye.java=

#+BEGIN_EXAMPLE
  $ javac Goodbye.java 
  $ java Goodbye

  Goodbye, cruel world
#+END_EXAMPLE

#+BEGIN_SRC java -n :bangle Goodbye.java :padline no
  /** Example program that demonstrates print vs println. */
  public class Goodbye {

    /** Prints a greeting. */
    public static void main(String[] args) {
      System.out.print("Goodbye, "); // note the space
      System.out.println("cruel world");
    }
  }
#+END_SRC

* 02 Variables and operators

