programming/java/code/think-java/think-java.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Think Java</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Think Java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2c2e80d">01 The way of the program</a>
<ul>
<li><a href="#orge4c520d"><code>Hello.java</code></a></li>
<li><a href="#orgfb60ba1"><code>Goodbye.java</code></a></li>
</ul>
</li>
<li><a href="#orgbdc1034">02 Variables and operators</a>
<ul>
<li><a href="#orgc1fcefd"><code>ch02/Variables.java</code></a></li>
</ul>
</li>
<li><a href="#org6a0b9fe">03 Input and output</a>
<ul>
<li><a href="#org3fe464e"><code>ch03/Input.java</code></a></li>
<li><a href="#org7e1b750"><code>ch03/ScannerBug.java</code></a></li>
<li><a href="#orge3d0ffb"><code>ch03/Echo.java</code></a></li>
<li><a href="#orge2c323e"><code>ch03/Convert.java</code></a></li>
<li><a href="#org709c959"><code>ch03/GuessStarter.java</code></a></li>
</ul>
</li>
<li><a href="#org876109c">04 Void methods</a>
<ul>
<li><a href="#org88f042f"><code>ch04/Methods.java</code></a></li>
<li><a href="#org935c5bf"><code>ch04/NewLine.java</code></a></li>
<li><a href="#org36956d7"><code>ch04/PrintTwice.java</code></a></li>
<li><a href="#org01c024a"><code>ch04/PrintTime.java</code></a></li>
<li><a href="#orge3ebe65"><code>ch04/Exercise.java</code></a></li>
</ul>
</li>
<li><a href="#orgdff77d6">05 Conditionals and logic</a>
<ul>
<li><a href="#orgcb6a0a7"><code>ch05/Conditional.java</code></a></li>
<li><a href="#org09c8f23"><code>ch05/Logarithm.java</code></a></li>
<li><a href="#org83d396c"><code>ch05/Recursion.java</code></a></li>
<li><a href="#org9a15a40"><code>ch05/Buzz.java</code></a></li>
<li><a href="#orga1f3d73"><code>ch05/Exercise.java</code></a></li>
</ul>
</li>
<li><a href="#org83f1428">06 Value methods</a>
<ul>
<li><a href="#org5382086"><code>ch06/Series.java</code></a></li>
<li><a href="#orga9c5295"><code>ch06/Recursive.java</code></a></li>
<li><a href="#orgc1cb098"><code>ch06/Exercise.java</code></a></li>
</ul>
</li>
<li><a href="#org908d8f6">07 Loops</a>
<ul>
<li><a href="#org550ed14"><code>ch07/Loops.java</code></a></li>
<li><a href="#org3c4be39"><code>ch07/Tables.java</code></a></li>
<li><a href="#orgfdf17d6"><code>ch07/Validate.java</code></a></li>
<li><a href="#orgd20123d"><code>ch07/Exercise.java</code></a></li>
</ul>
</li>
<li><a href="#org646eaa2">08 Arrays</a>
<ul>
<li><a href="#org3d2a228"><code>ch08/ArrayExamples.java</code></a></li>
<li><a href="#org4924749"><code>ch08/Fruit.java</code></a></li>
<li><a href="#org6f3bf78"><code>ch08/Histogram.java</code></a></li>
<li><a href="#org8c541fa"><code>ch08/MakeDubMus.java</code></a></li>
</ul>
</li>
<li><a href="#orgbc2ee1b">09 Strings and things</a>
<ul>
<li><a href="#org25f4cff"><code>ch09/StringsThings.java</code></a></li>
<li><a href="#orgb083ecf"><code>ch09/Format.java</code></a></li>
<li><a href="#orga34512e"><code>ch09/Max.java</code></a></li>
<li><a href="#org58f74b5"><code>ch09/Recurse.java</code></a></li>
<li><a href="#orge4036b9"><code>ch09/Exercise.java</code></a></li>
</ul>
</li>
<li><a href="#org258342d">10 Objects</a>
<ul>
<li><a href="#orge51d35b"><code>ch10/PointRect.java</code></a></li>
<li><a href="#orge5f724d"><code>ch10/Pow.java</code></a></li>
<li><a href="#org4c74f90"><code>ch10/Riddle.java</code></a></li>
</ul>
</li>
<li><a href="#orgeb772f6">11 Classes</a>
<ul>
<li><a href="#org464c3a6"><code>ch11/Time.java</code></a></li>
<li><a href="#org6c3f22a"><code>ch11/TimeClient.java</code></a></li>
</ul>
</li>
<li><a href="#org4944929">12 Arrays of objects</a>
<ul>
<li><a href="#org5c4f158"><code>ch12/Card.java</code></a></li>
<li><a href="#org04d8b48"><code>ch12/CardTable.java</code></a></li>
<li><a href="#orga0d4694"><code>ch12/Search.java</code></a></li>
</ul>
</li>
<li><a href="#org62271ef">13 Objects of arrays</a>
<ul>
<li><a href="#orgbc205ae"><code>ch13/Deck.java</code></a></li>
<li><a href="#org79b4589"><code>ch13/Test.java</code></a></li>
<li><a href="#orgcb17a55"><code>ch13/Card.java</code></a></li>
</ul>
</li>
<li><a href="#org4c574eb">14 Objects of objects</a>
<ul>
<li><a href="#org23fc582"><code>ch14/CardCollection.java</code></a></li>
<li><a href="#org293180d"><code>ch14/Deck.java</code></a></li>
<li><a href="#org5580701"><code>ch14/Eights.java</code></a></li>
<li><a href="#orgd35cd00"><code>ch14/Hand.java</code></a></li>
<li><a href="#org0095add"><code>ch14/Player.java</code></a></li>
<li><a href="#orgcb98dd3"><code>ch14/Test.java</code></a></li>
<li><a href="#orgaab0d0e"><code>ch14/Card.java</code></a></li>
</ul>
</li>
<li><a href="#org3e650e9">app</a>
<ul>
<li><a href="#org9e5f9bd"><code>ap01/Series.java</code></a></li>
<li><a href="#org2a1df33"><span class="todo TODO">TODO</span> <code>ap01/SeriesTest.java</code></a></li>
<li><a href="#orgd798efd"><code>ap02/Drawing.java</code></a></li>
<li><a href="#orgc267261"><code>ap02/Mickey.java</code></a></li>
<li><a href="#org1add459"><code>ap02/Moire.java</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2c2e80d" class="outline-2">
<h2 id="org2c2e80d">01 The way of the program</h2>
<div class="outline-text-2" id="text-org2c2e80d">
</div>
<div id="outline-container-orge4c520d" class="outline-3">
<h3 id="orge4c520d"><code>Hello.java</code></h3>
<div class="outline-text-3" id="text-orge4c520d">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Hello</span> {
<span class="linenr">2: </span>
<span class="linenr">3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">4: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">generate some simple output</span>
<span class="linenr">5: </span>    System.out.println(<span style="color: #848ea9;">"Hello, World!"</span>);
<span class="linenr">6: </span>  }
<span class="linenr">7: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb60ba1" class="outline-3">
<h3 id="orgfb60ba1"><code>Goodbye.java</code></h3>
<div class="outline-text-3" id="text-orgfb60ba1">
<pre class="example">
$ javac Goodbye.java 
$ java Goodbye

Goodbye, cruel world
</pre>

<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #848ea9;">/** Example program that demonstrates print vs println. */</span>
<span class="linenr">2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Goodbye</span> {
<span class="linenr">3: </span>
<span class="linenr">4: </span>  <span style="color: #848ea9;">/** Prints a greeting. */</span>
<span class="linenr">5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">6: </span>    System.out.print(<span style="color: #848ea9;">"Goodbye, "</span>); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">note the space</span>
<span class="linenr">7: </span>    System.out.println(<span style="color: #848ea9;">"cruel world"</span>);
<span class="linenr">8: </span>  }
<span class="linenr">9: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbdc1034" class="outline-2">
<h2 id="orgbdc1034">02 Variables and operators</h2>
<div class="outline-text-2" id="text-orgbdc1034">
</div>
