programming/java/code/think-java/think-java.org
** =ch09/Format.java=

#+BEGIN_SRC java -n :bangle Format.java :padline no
  /** Example using the String.format method. */
  public class Format {

    /**
     ,* Returns a time string in 12-hour format.
     ,*
     ,* @param hour between 0 and 23
     ,* @param minute between 0 and 59
     ,*/
    public static String timeString(int hour, int minute) {
      String ampm;
      if (hour < 12) {
        ampm = "AM";
        if (hour == 0) {
          hour = 12; // midnight
        }
      } else {
        ampm = "PM";
        hour = hour - 12;
      }
      return String.format("%02d:%02d %s", hour, minute, ampm);
    }

    public static void main(String[] args) {
      System.out.println(timeString(0, 0));
      System.out.println(timeString(7, 30));
      System.out.println(timeString(12, 5));
      System.out.println(timeString(23, 59));
    }
  }
#+END_SRC

** =ch09/Max.java=

#+BEGIN_SRC java -n :bangle Max.java :padline no
  import java.util.Arrays;

  /** Demonstrates command-line arguments. */
  public class Max {

    /** Converts args to integers and prints the max. */
    public static void main(String[] args) {
      System.out.println(Arrays.toString(args));

      int max = Integer.MIN_VALUE;
      for (String arg : args) {
        int value = Integer.parseInt(arg);
        if (value > max) {
          max = value;
        }
      }
      System.out.println("The max is " + max);
    }
  }
#+END_SRC

** =ch09/Recurse.java=

#+BEGIN_SRC java -n :bangle Recurse.java :padline no
  /** Recursion exercise. */
  public class Recurse {

    /** Returns the first character of the given String. */
    public static char first(String s) {
      return s.charAt(0);
    }

    /** Returns all but the first letter of the given String. */
    public static String rest(String s) {
      return s.substring(1);
    }

    /** Returns all but the first and last letter of the String. */
    public static String middle(String s) {
      return s.substring(1, s.length() - 1);
    }

    /** Returns the length of the given String. */
    public static int length(String s) {
      return s.length();
    }
  }
#+END_SRC

** =ch09/Exercise.java=

#+BEGIN_SRC java -n :bangle Exercise.java :padline no
  /** Exercise on encapsulation and generalization. */
  public class Exercise {

    public static void main(String[] args) {
      String s = "((3 + 7) * 2)";
      int count = 0;

      for (int i = 0; i < s.length(); i++) {
        char c = s.charAt(i);
        if (c == '(') {
          count++;
        } else if (c == ')') {
          count--;
        }
      }

      System.out.println(count);
    }
  }
#+END_SRC

* 10 Objects

