programming/java/code/think-java/think-java.html

<div id="outline-container-orgb083ecf" class="outline-3">
<h3 id="orgb083ecf"><code>ch09/Format.java</code></h3>
<div class="outline-text-3" id="text-orgb083ecf">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** Example using the String.format method. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Format</span> {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  <span style="color: #848ea9;">/**</span>
<span class="linenr"> 5: </span><span style="color: #848ea9;">   * Returns a time string in 12-hour format.</span>
<span class="linenr"> 6: </span><span style="color: #848ea9;">   *</span>
<span class="linenr"> 7: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> hour between 0 and 23</span>
<span class="linenr"> 8: </span><span style="color: #848ea9;">   * </span><span style="color: #d55e00; font-weight: bold;">@param</span><span style="color: #848ea9;"> minute between 0 and 59</span>
<span class="linenr"> 9: </span><span style="color: #848ea9;">   */</span>
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">timeString</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">hour</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">minute</span>) {
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">ampm</span>;
<span class="linenr">12: </span>    <span style="color: #56b4e9; font-weight: bold;">if</span> (hour &lt; 12) {
<span class="linenr">13: </span>      ampm = <span style="color: #848ea9;">"AM"</span>;
<span class="linenr">14: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (hour == 0) {
<span class="linenr">15: </span>        hour = 12; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">midnight</span>
<span class="linenr">16: </span>      }
<span class="linenr">17: </span>    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">18: </span>      ampm = <span style="color: #848ea9;">"PM"</span>;
<span class="linenr">19: </span>      hour = hour - 12;
<span class="linenr">20: </span>    }
<span class="linenr">21: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> String.format(<span style="color: #848ea9;">"%02d:%02d %s"</span>, hour, minute, ampm);
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>
<span class="linenr">24: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr">25: </span>    System.out.println(timeString(0, 0));
<span class="linenr">26: </span>    System.out.println(timeString(7, 30));
<span class="linenr">27: </span>    System.out.println(timeString(12, 5));
<span class="linenr">28: </span>    System.out.println(timeString(23, 59));
<span class="linenr">29: </span>  }
<span class="linenr">30: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga34512e" class="outline-3">
<h3 id="orga34512e"><code>ch09/Max.java</code></h3>
<div class="outline-text-3" id="text-orga34512e">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #848ea9;">/** Demonstrates command-line arguments. */</span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Max</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #848ea9;">/** Converts args to integers and prints the max. */</span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 8: </span>    System.out.println(Arrays.toString(args));
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span> = <span style="color: #d55e00; font-weight: bold;">Integer</span>.MIN_VALUE;
<span class="linenr">11: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">arg</span> : args) {
<span class="linenr">12: </span>      <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">value</span> = Integer.parseInt(arg);
<span class="linenr">13: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (value &gt; max) {
<span class="linenr">14: </span>        max = value;
<span class="linenr">15: </span>      }
<span class="linenr">16: </span>    }
<span class="linenr">17: </span>    System.out.println(<span style="color: #848ea9;">"The max is "</span> + max);
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org58f74b5" class="outline-3">
<h3 id="org58f74b5"><code>ch09/Recurse.java</code></h3>
<div class="outline-text-3" id="text-org58f74b5">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** Recursion exercise. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Recurse</span> {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  <span style="color: #848ea9;">/** Returns the first character of the given String. */</span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #d55e00;">first</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span>) {
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> s.charAt(0);
<span class="linenr"> 7: </span>  }
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>  <span style="color: #848ea9;">/** Returns all but the first letter of the given String. */</span>
<span class="linenr">10: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">rest</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span>) {
<span class="linenr">11: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> s.substring(1);
<span class="linenr">12: </span>  }
<span class="linenr">13: </span>
<span class="linenr">14: </span>  <span style="color: #848ea9;">/** Returns all but the first and last letter of the String. */</span>
<span class="linenr">15: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">middle</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span>) {
<span class="linenr">16: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> s.substring(1, s.length() - 1);
<span class="linenr">17: </span>  }
<span class="linenr">18: </span>
<span class="linenr">19: </span>  <span style="color: #848ea9;">/** Returns the length of the given String. */</span>
<span class="linenr">20: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">length</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span>) {
<span class="linenr">21: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> s.length();
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4036b9" class="outline-3">
<h3 id="orge4036b9"><code>ch09/Exercise.java</code></h3>
<div class="outline-text-3" id="text-orge4036b9">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** Exercise on encapsulation and generalization. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Exercise</span> {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span> = <span style="color: #848ea9;">"((3 + 7) * 2)"</span>;
<span class="linenr"> 6: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">count</span> = 0;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0; i &lt; s.<span style="color: #0072b2; font-weight: bold;">length</span>(); i++) {
<span class="linenr"> 9: </span>      <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">c</span> = s.charAt(i);
<span class="linenr">10: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'('</span>) {
<span class="linenr">11: </span>        count++;
<span class="linenr">12: </span>      } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">')'</span>) {
<span class="linenr">13: </span>        count--;
<span class="linenr">14: </span>      }
<span class="linenr">15: </span>    }
<span class="linenr">16: </span>
<span class="linenr">17: </span>    System.out.println(count);
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>}
</pre>
</div>
</div>
</div>
</div>
