programming/java/code/think-java/think-java.org
** =ch11/TimeClient.java=

#+BEGIN_SRC java -n :bangle TimeClient.java :padline no
  /** Class that uses Time objects. */
  public class TimeClient {

    public static void main(String[] args) {
      Time time = new Time(11, 59, 59.9);
      System.out.println(time);

      // cannot access private variables from another class
      // System.out.println(time.hour);

      String s = time.toString();
      System.out.println(s);

      Time time1 = new Time(9, 30, 0.0);
      Time time2 = time1;
      Time time3 = new Time(9, 30, 0.0);

      System.out.println(time1 == time2);
      System.out.println(time1 == time3);
      System.out.println(time1.equals(time2));
      System.out.println(time1.equals(time3));

      Time startTime = new Time(18, 50, 0.0);
      Time runningTime = new Time(2, 16, 0.0);
      Time endTime = Time.add(startTime, runningTime);

      // using the instance method
      endTime = startTime.add(runningTime);
    }
  }
#+END_SRC

* 12 Arrays of objects

** =ch12/Card.java=

#+BEGIN_SRC java -n :bangle Card.java :padline no
  /** A standard playing card. */
  public class Card {

    public static final String[] RANKS = {
      null, "Ace", "2", "3", "4", "5", "6", "7", "8", "9", "10", "Jack", "Queen", "King"
    };

    public static final String[] SUITS = {"Clubs", "Diamonds", "Hearts", "Spades"};

    private final int rank;

    private final int suit;

    /** Constructs a card of the given rank and suit. */
    public Card(int rank, int suit) {
      this.rank = rank;
      this.suit = suit;
    }

    /**
     ,* Returns a negative integer if this card comes before the given card, zero if the two cards are
     ,* equal, or a positive integer if this card comes after the card.
     ,*/
    public int compareTo(Card that) {
      if (this.suit < that.suit) {
        return -1;
      }
      if (this.suit > that.suit) {
        return 1;
      }
      if (this.rank < that.rank) {
        return -1;
      }
      if (this.rank > that.rank) {
        return 1;
      }
      return 0;
    }

    /** Returns true if the given card has the same rank AND same suit; otherwise returns false. */
    public boolean equals(Card that) {
      return this.rank == that.rank && this.suit == that.suit;
    }

    /** Gets the card's rank. */
    public int getRank() {
      return this.rank;
    }

    /** Gets the card's suit. */
    public int getSuit() {
      return this.suit;
    }

    /** Returns the card's index in a sorted deck of 52 cards. */
    public int position() {
      return this.suit * 13 + this.rank - 1;
    }

    /** Returns a string representation of the card. */
    public String toString() {
      return RANKS[this.rank] + " of " + SUITS[this.suit];
    }
  }
#+END_SRC

