programming/java/code/think-java/think-java.html

<div id="outline-container-org6c3f22a" class="outline-3">
<h3 id="org6c3f22a"><code>ch11/TimeClient.java</code></h3>
<div class="outline-text-3" id="text-org6c3f22a">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** Class that uses Time objects. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TimeClient</span> {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">time</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Time</span>(11, 59, 59.9);
<span class="linenr"> 6: </span>    System.out.println(time);
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">cannot access private variables from another class</span>
<span class="linenr"> 9: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">System.out.println(time.hour);</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">s</span> = time.toString();
<span class="linenr">12: </span>    System.out.println(s);
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">time1</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Time</span>(9, 30, 0.0);
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">time2</span> = time1;
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">time3</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Time</span>(9, 30, 0.0);
<span class="linenr">17: </span>
<span class="linenr">18: </span>    System.out.println(time1 == time2);
<span class="linenr">19: </span>    System.out.println(time1 == time3);
<span class="linenr">20: </span>    System.out.println(time1.equals(time2));
<span class="linenr">21: </span>    System.out.println(time1.equals(time3));
<span class="linenr">22: </span>
<span class="linenr">23: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">startTime</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Time</span>(18, 50, 0.0);
<span class="linenr">24: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">runningTime</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Time</span>(2, 16, 0.0);
<span class="linenr">25: </span>    <span style="color: #0072b2; font-weight: bold;">Time</span> <span style="color: #e69f00; font-weight: bold;">endTime</span> = Time.add(startTime, runningTime);
<span class="linenr">26: </span>
<span class="linenr">27: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">using the instance method</span>
<span class="linenr">28: </span>    endTime = startTime.add(runningTime);
<span class="linenr">29: </span>  }
<span class="linenr">30: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4944929" class="outline-2">
<h2 id="org4944929">12 Arrays of objects</h2>
<div class="outline-text-2" id="text-org4944929">
</div>
