programming/java/code/think-java/think-java.html

<div id="outline-container-org293180d" class="outline-3">
<h3 id="org293180d"><code>ch14/Deck.java</code></h3>
<div class="outline-text-3" id="text-org293180d">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** A deck of playing cards. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Deck</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">CardCollection</span> {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  <span style="color: #848ea9;">/** Constructs a standard deck of 52 cards. */</span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Deck</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">label</span>) {
<span class="linenr"> 6: </span>    <span style="color: #56b4e9; font-weight: bold;">super</span>(label);
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">suit</span> = 0; suit &lt;= 3; suit++) {
<span class="linenr"> 9: </span>      <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">rank</span> = 1; rank &lt;= 13; rank++) {
<span class="linenr">10: </span>        addCard(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Card</span>(rank, suit));
<span class="linenr">11: </span>      }
<span class="linenr">12: </span>    }
<span class="linenr">13: </span>  }
<span class="linenr">14: </span>}
</pre>
</div>
</div>
</div>
