programming/java/code/think-java/think-java.html

<div id="outline-container-orgcb98dd3" class="outline-3">
<h3 id="orgcb98dd3"><code>ch14/Test.java</code></h3>
<div class="outline-text-3" id="text-orgcb98dd3">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #848ea9;">/** Test code for Deck and Hand. */</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Test</span> {
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 5: </span>    <span style="color: #0072b2; font-weight: bold;">Deck</span> <span style="color: #e69f00; font-weight: bold;">deck</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Deck</span>(<span style="color: #848ea9;">"Deck"</span>);
<span class="linenr"> 6: </span>    deck.shuffle();
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">Hand</span> <span style="color: #e69f00; font-weight: bold;">hand</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Hand</span>(<span style="color: #848ea9;">"Hand"</span>);
<span class="linenr"> 9: </span>    deck.deal(hand, 5);
<span class="linenr">10: </span>    hand.display();
<span class="linenr">11: </span>
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">Hand</span> <span style="color: #e69f00; font-weight: bold;">drawPile</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Hand</span>(<span style="color: #848ea9;">"Draw Pile"</span>);
<span class="linenr">13: </span>    deck.dealAll(drawPile);
<span class="linenr">14: </span>    System.out.printf(<span style="color: #848ea9;">"Draw Pile has %d cards.\n"</span>, drawPile.size());
<span class="linenr">15: </span>  }
<span class="linenr">16: </span>}
</pre>
</div>
</div>
</div>
